{
  "intro": "See teadmistebaas käsitleb IKT ja AI teenuste eksporti erinevatesse riikidesse. Eesmärk on anda üldine raamistik, millistele regulatiivsetele ja praktilistele teemadele tuleks uuele turule sisenemisel tähelepanu pöörata. Riigipõhise info (näiteks konkreetne miinimumtöövanus või andmekaitse seaduse nimi) leidmiseks kasutab agent veebipõhist otsingut.",
  "topics": [
    {
      "id": "general_export_checks",
      "title": "Üldised kontrollid enne IKT ekspordi alustamist",
      "content": [
        "Selgita, millist teenust täpselt pakud (pilveteenus, SaaS, tarkvaralitsents, konsultatsioon, AI mudeli kasutus jne).",
        "Uuri, kas sihtriigis on sinu teenuse suhtes eriregulatsioone (näiteks finants-, tervishoiu-, kaitsesektor).",
        "Kontrolli, kas teenuse eksportimisel võib olla ekspordikontrolli piiranguid (krüptograafia, kaksikkasutusega tehnoloogia).",
        "Vaata, kas on vaja registreerida juriidiline üksus, filiaal või saab tegutseda olemasoleva ettevõtte alt.",
        "Analüüsi, milliseid andmeid pead koguma, kuhu neid salvestad ja kes neile ligi pääseb."
      ]
    },
    {
      "id": "data_protection",
      "title": "Andmekaitse ja privaatsus IKT teenuste puhul",
      "content": [
        "Peaaegu igal riigil on oma andmekaitse raamistik (näiteks Euroopa Liidus GDPR, Kanadas PIPEDA, Brasiilias LGPD).",
        "Kaardista, milliseid isikuandmeid sinu teenus töötleb (profiiliandmed, kontaktid, logid, käitumisandmed, asukoht, makseinfo).",
        "Selgita, mis on andmetöötluse eesmärk ja õiguslik alus (nõusolek, lepingu täitmine, õigustatud huvi jms).",
        "Kontrolli, kas riik nõuab andmete lokaliseerimist, st kas andmeid peab hoidma konkreetses riigis või regioonis.",
        "Valmista ette privaatsustingimused ja andmetöötluslepingud partneritega (controller / processor rollid)."
      ]
    },
    {
      "id": "employment_and_work_age",
      "title": "Tööregulatsioonid ja miinimumtöövanus",
      "content": [
        "Iga riik määrab ise miinimumtöövanuse ja alaealiste töötamise tingimused (tööaeg, tööliigid, vanema nõusolek jms).",
        "Enne praktikandi, noore arendaja või osalise koormusega töötaja palkamist uude riiki kontrolli alati kohalikke tööõiguse norme.",
        "Välismaalt töötaja palkamisel uude riiki tuleb arvestada ka tööloa või immigratsioonireeglitega.",
        "IKT sektori puhul võivad kehtida samad üldised töönormid, kuid kaug- ja platvormitöö osas võivad olla erisused.",
        "Riigipõhise miinimumtöövanuse ja muude detailide leidmiseks tuleb kasutada ajakohaseid allikaid (seaduse tekst, valitsuse lehed)."
      ]
    },
    {
      "id": "tax_and_entity",
      "title": "Maksud ja juriidiline struktuur",
      "content": [
        "Selgita, kas pead sihtriigis registreerima juriidilise isiku, filiaali või püsiva tegevuskoha (permanent establishment).",
        "Vaata, kuidas maksustatakse välismaist teenusepakkujat – näiteks käibemaks/digiteenuste maks, ettevõtte tulumaks, kinnipeetavad maksud.",
        "Kontrolli topeltmaksustamise vältimise lepingu olemasolu koduriigi ja sihtriigi vahel.",
        "Hinda, kas on mõistlik kasutada kohalikke raamatupidamis- või maksunõustaja teenuseid, et vältida hilisemaid riske.",
        "Arvesta, et maksureeglid muutuvad ajas – ajakohane info tuleb võtta ametlikest allikatest või nõustajalt."
      ]
    },
    {
      "id": "contracts_and_risk",
      "title": "Lepingud, vastutus ja riskijuhtimine",
      "content": [
        "Lepingutes tuleks selgelt kokku leppida teenuse sisu, teenustasud, tugi, hooldus ja SLA (teenuse taseme kokkulepped).",
        "Määra, milline seadus on lepingule kohaldatav ja milline kohus või vahekohus lahendab vaidlused.",
        "Andmekaitse ja infoturbe tingimused peaks olema eraldi ja detailselt lahti kirjutatud (krüpteerimine, ligipääsud, logimine, intsidendihalduse kord).",
        "Analüüsi, milliseid riske (andmeleke, teenusekatkestus, valeandmed) sa saad kindlustuse või lepinguliste piirangutega maandada.",
        "Rahvusvaheliste lepingute puhul on sageli mõistlik kasutada juristi, kes tunneb nii koduriigi kui sihtriigi õigust."
      ]
    }
  ]
}
